Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བློ་གྲོས་རྒྱ་མཚོ་རྣམ་གྲངས་འདིས་འདི་ལྟར་ཇི་ལྟར་བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྙེད་དཀའ་བ་མ་ཡིན་པ་དེ་རིག་པར་བྱའོ། །
en: Sāgaramati, one should understand from this lesson that unsurpassed and perfect awakening is not difficult for bodhisattvas who practice diligence.

source: བློ་གྲོས་རྒྱ་མཚོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲངས་མེད་པ་བདུན་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་བསྐལ་པ་མེ་ཏོག་གི་འབྱུང་གནས་ལ་ཤིན་ཏུ་རྣམ་པར་བལྟས་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བཅོམ་ལྡན་འདས་བརྩོན་འགྲུས་འབར་བ་ཞེས་བྱ་བའི་
en: “Sāgaramati, at one point in the past, seven immeasurable eons ago, there was an eon called Flower Origin. At that time there was a world called Astounding Sight in which the blessed buddha Dīptavīrya appeared.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: He was a thus-gone, worthy, perfect buddha, someone learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, and a teacher of gods and humans.

source: ཅིའི་ཕྱིར་བསྐལ་པ་དེ་མེ་ཏོག་གི་འབྱུང་གནས་ཞེས་བྱ་ཞེ་ན།
en: “Why was that eon called Flower Origin?

source: བློ་གྲོས་རྒྱ་མཚོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཚིག་སྟེ་ཆུས་འཇིག་པ་བྱུང་བ་ན་པད་མ་ལོ་མ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྡན་པ། རྣམ་པར་བཀྲ་བ་བལྟ་ན་སྡུག་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱུང་ནས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཆུའི་ཕུང་པོ་དེ་རྒྱས་པར་བཀང་སྟེ་གནས་སོ། །
en: Sāgaramati, when the worlds of that trichiliocosm burned and were subsequently destroyed by water, eighty-four thousand radiant and beautiful lotuses with tens of trillions of petals appeared and filled that mass of water.

source: དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་དག་གིས་པད་མ་དེ་དག་མཐོང་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: When the gods of the pure realms saw those lotuses, they were satisfied, happy, delighted, joyful, and at ease.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་པད་མ་འདི་དག་བྱུང་བ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ།
en: Experiencing such joy and pleasure, they saw these flowers to be indicative of the extent of the perfect buddhas to appear in the world.

source: ཀྱེ་མ་བསྐལ་པ་མེ་ཏོག་གི་འབྱུང་གནས་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སྟོངས་པར་མི་འགྱུར་རོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: Thus, they exclaimed, ‘Amazing! This eon Flower Origin will not be empty of blessed buddhas.’

source: དེ་ལྟར་ན་མེ་ཏོག་གི་འབྱུང་གནས་མེ་ཏོག་གི་འབྱུང་གནས་ཞེས་བསྐལ་པ་དེའི་མིང་ཆགས་སོ། །
en: And that is how Flower Origin came to be called Flower Origin.

source: བློ་གྲོས་རྒྱ་མཚོ་ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཤིན་ཏུ་རྣམ་པར་བལྟས་པ་ཞེས་བྱ་ཞེ་ན།
en: “Why was that world called Astounding Sight, Sāgaramati?

source: ཇི་ཙམ་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ནས་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་དེ་རྣམ་པར་བལྟ་བའི་ཕྱིར་ལྷགས་པ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལ་རྣམ་པར་བལྟས་མ་ཐག་ཏུ། དགའ་བའི་རྣམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་སྟེབདེ་བ་ཐམས་ཅད་ཀྱིས་ཚིམ་པར་འགྱུར་བ་དེ་ཙམ་དུ་
en: When countless and fathomless numbers of bodhisattvas came from the buddha realms of the ten directions to behold this universe, they immediately achieved an absorption called ‘joyful appearance’ and were satisfied with every kind of pleasure.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡོངས་སུ་དག་པར་གྱུར་ཏེ་དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཤིན་ཏུ་རྣམ་པར་བལྟས་པ་ཞེས་བྱའོ། །
en: This world was that pure. Thus, this world was called Astounding Sight.

source: བློ་གྲོས་རྒྱ་མཚོ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་རིན་པོ་ཆེ་སྣ་བདུན་ཕྲག་སྟོང་གནས་པར་གྱུར་ཏོ། །
en: Sāgaramati, in this world the seven precious materials existed by the thousands.

source: རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དང་། རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་རྣམས་ཀྱིས་ཀྱང་ཀུན་ཏུ་གསལ་བར་གྱུར་ཏོ། །
en: The jeweled trees and jeweled mansions were luminous.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བུད་མེད་ཀྱི་བག་མེད་པར་གྱུར་ཅིང་མངལ་ན་གནས་པ་མེད་དེ་
en: This world was free from female lust and pregnancy.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་པད་མ་རྣམས་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་པར་བརྫུས་ཏེ་བྱུང་ངོ་། །
en: Instead, everyone there was born miraculously, seated cross-legged in lotuses.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཐེག་པ་ཆེན་པོ་མ་གཏོགས་པར་ཐེག་པ་གཞན་རྣམ་པར་གཞག་པ་མེད་པར་གྱུར་ཏོ། །
en: Nobody in this world practiced any other vehicle than the Great Vehicle.

source: ལྷ་དང་མི་དེ་དག་ཀྱང་ཡོངས་སུ་སྤྱད་པ་དག་ནི་དགའ་ལྡན་གྱི་ལྷ་དང་འདྲ་བར་བཟའ་བ་དང་བཏུང་བ་ཡང་བསམས་པས་འབྱོར་པ།
en: The gods and humans subsisted by enjoying food and drink at their wish, like the gods of the Heaven of Joy.

source: མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེན་པ། ནམ་མཁའ་ལ་རྒྱུ་བ་དག་གོ། །
en: They sported with super-knowledge and flew through space.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་འབར་བའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་བྱུང་བར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཏུ་གྱུར་ཏོ། །
en: “The blessed thus-gone Dīptavīrya’s bodhisattva saṅgha was composed of 360 million ordained bodhisattva great beings.

source: དེ་ན་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་ཚད་མེད་པ་དག་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པ་དག་གོ། །
en: The limitless lay and ordained practitioners were all engaged in the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་འབར་བ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་རྩོམས་ཤིག །ཁྱོད་རྟག་ཏུ་རྟུལ་བ་བརྟན་པ་དང་། འདུན་པ་དྲག་པོར་གྱིས་ཤིག །རྟག་ཏུ་གཅེས་པ་མ་འདོར་ཅིག་ཅེས་བརྩོན་འགྲུས་དང་ལྡན་པའི་གཏམ་ཉིད་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “Sāgaramati, the blessed thus-gone Dīptavīrya gave extensive teachings on diligence, encouraging these bodhisattvas, saying, ‘Sublime beings, you must practice diligence. You must persevere and show fierce determination. You must not lose your dedication.’

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཅ་སྲ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེར་འདུས་པར་གྱུར་པ་དེས།
en: “At that point, Sāgaramati, the bodhisattva great being Solid Armor was among the bodhisattva assembly.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པ་ལགས།
en: ‘Blessed One, how should a bodhisattva practice diligence?

source: དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གནང་བའི་བརྩོན་འགྲུས་ནི་གང་ལགས།
en: Please describe the diligence that the Thus-Gone One has encouraged in the bodhisattvas.’

source: བློ་གྲོས་རྒྱ་མཚོ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་འབར་བ་དེས། བྱང་ཆུབ་སེམས་དཔའ་གོ་ཆ་བརྟན་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Sāgaramati, the blessed thus-gone Dīptavīrya answered the bodhisattva Solid Armor, saying,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྡུད་པར་འགྱུར་བའི་བརྩོན་འགྲུས་ནི་བཞི་པོ་འདི་ལྟ་སྟེ།
en: ‘Noble son, there are four types of diligence that assemble the virtuous qualities of bodhisattvas.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: འདི་ལྟ་སྟེ་རྩོམ་པ་དང་། རྟུལ་བ་དང་། སོ་སོར་རྟོག་པ་དང་། སྒྲུབ་པ་སྟེ།
en: They are endeavor, commitment, contemplation, and accomplishment.

source: རིགས་ཀྱི་བུ་བརྩོན་འགྲུས་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྡུད་པར་འགྱུར་བའོ། །
en: Noble son, these four types of diligence assemble the virtuous qualities of bodhisattvas.

source: དེ་ལ་རྩོམ་པ་ནི་གང་། རྟུལ་བ་ནི་གང་། སོ་སོར་རྟོག་པ་ནི་གང་། སྒྲུབ་པ་ནི་གང་ཞེ་ན།
en: What then are endeavor, commitment, contemplation, and accomplishment?

source: རིགས་ཀྱི་བུ་རྩོམ་པ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པའོ། །
en: “ ‘Noble son, endeavor is developing the mind directed toward awakening.

source: རྟུལ་བ་ཞེས་བྱ་བ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་སྒྲུབ་པའོ། །
en: Commitment is cultivating all roots of virtue.

source: སོ་སོར་རྟོག་པ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་དངོས་པོའོ། །
en: Contemplation is the means of benefiting all beings.

source: སྒྲུབ་པ་ཞེས་བྱ་བ་ནི་དེ་བྱེད་པའི་ཆོས་ལ་བཟོད་པའོ། །
en: Accomplishment is accepting that which brings this about.

source: གཞན་ཡང་རྩོམ་པ་ནི་ཐོས་པ་ཡོངས་སུ་ཚོལ་བའོ། །
en: “ ‘Also, endeavor is seeking out study.

source: རྟུལ་བ་ནི་ཐོས་པ་སྟོན་པའོ། །
en: Commitment is displaying learnedness.

source: སོ་སོར་རྟོག་པ་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའོ། །
en: Contemplation is appropriate mental engagement.

source: སྒྲུབ་པ་ནི་འཕགས་པའི་ཡང་དག་པའི་ལྟ་བའོ། །
en: Accomplishment is the right view of noble beings.

source: གཞན་ཡང་རྩོམ་པ་ནི་སེར་སྣའི་སེམས་ཚར་གཅོད་པའོ། །
en: “ ‘Also, endeavor is eliminating the mind of stinginess.

source: རྟུལ་བ་ནི་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའོ། །
en: Commitment is giving up all one’s things.

source: སོ་སོར་རྟོག་པ་ནི་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །
en: Contemplation is dedicating everything to awakening alongside all beings.

source: སྒྲུབ་པ་ནི་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའོ། །
en: Accomplishment is not hoping for ripening.

source: གཞན་ཡང་རྩོམ་པ་ནི་གཏོང་བ་ཆེན་པོ་སྒྲོགས་པའོ། །
en: “ ‘Also, endeavor is professing great charity.

source: རྟུལ་བ་ནི་གང་སློང་བ་པོ་རྣམས་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་པའོ། །
en: Commitment is perceiving all beggars as spiritual friends.

source: སོ་སོར་རྟོག་པ་ནི་ཀྱེ་མའོ། །ལོངས་སྤྱོད་འདི་དག་མི་རྟག་པའོ་སྙམ་པའོ། །
en: Contemplation is weariness with one’s impermanent possessions.

source: སྒྲུབ་པ་ནི་བྱིན་ནས་འགྱོད་པ་མེད་པའོ། །
en: Accomplishment is not regretting giving.

source: གཞན་ཡང་རྩོམ་པ་ནི་ཆོས་ཀྱིས་ལོངས་སྤྱོད་ཡོངས་སུ་ཚོལ་བའོ། །
en: “ ‘Also, endeavor is seeking out the wealth of Dharma.

source: རྟུལ་བ་ནི་འཚོ་བ་ཡོངས་སུ་དག་པའོ། །
en: Commitment is having a pure livelihood.

source: སོ་སོར་རྟོག་པ་ནི་བདག་གིས་སྙིང་པོ་བླངས་པར་འགྱུར་རོ་སྙམ་པའོ། །
en: Contemplation is having the sense that one is living meaningfully.

source: སྒྲུབ་པ་ནི་སྦྱིན་པས་རློམ་སེམས་སུ་མི་བྱེད་པའོ། །
en: Accomplishment is not becoming proud about being generous.

source: གཞན་ཡང་རྩོམ་པ་ནི་འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱི་དྲི་མ་སེལ་བའོ། །
en: “ ‘Also, endeavor is eliminating the stain of corrupt discipline.

source: རྟུལ་བ་ནི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་མ་ཉམས་པའོ། །
en: Commitment is not letting up on discipline and asceticism.

source: སོ་སོར་རྟོག་པ་ནི་ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའོ། །
en: Contemplation is ripening beings who have corrupt discipline.

source: སྒྲུབ་པ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཡོན་ཏན་གྱིས་རློམ་སེམས་སུ་མི་བྱེད་པའོ། །
en: Accomplishment is not becoming proud about the qualities of discipline.

source: གཞན་ཡང་རྩོམ་པ་ནི་ལུས་ཡོངས་སུ་དག་པའོ། །
en: “ ‘Also, endeavor is purifying the body.

source: རྟུལ་བ་ནི་ངག་ཡོངས་སུ་དག་པའོ། །
en: Commitment is purifying the speech.

source: སོ་སོར་རྟོག་པ་ནི་སེམས་ཡོངས་སུ་དག་པའོ། །
en: Contemplation is purifying the mind.

source: སྒྲུབ་པ་ནི་ཆོས་ཡོངས་སུ་དག་པའོ། །
en: Accomplishment is purifying phenomena.

source: གཞན་ཡང་རྩོམ་པ་ནི་གནོད་སེམས་ཀྱི་སེམས་ཀྱི་སྐབས་མེད་པའོ། །
en: “ ‘Also, endeavor is giving malice no chance.

source: རྟུལ་བ་ནི་བཟོད་པའི་སྟོབས་རྣམས་རྣམ་པར་རིག་པའོ། །
en: Commitment is understanding the power of patience.

source: སོ་སོར་རྟོག་པ་ནི་བདག་དང་གཞན་སྲུང་བའོ། །
en: Contemplation is protecting self and other.

source: སྒྲུབ་པ་ནི་བཟོད་པའི་རློམ་སེམས་སུ་མི་བྱེད་པའོ། །
en: Accomplishment is not becoming proud about patience.

source: གཞན་ཡང་རྩོམ་པ་ནི་གཤེ་བ་དང་། སྡང་བ་དད་པར་བྱེད་པའོ། །
en: “ ‘Also, endeavor is maintaining faith in the face of criticism and aggression.

source: རྟུལ་བ་ནི་གཤེ་བ་དང་སྡང་བ་འདྲིས་པར་མི་བྱེད་པའོ། །
en: Commitment is not becoming familiar with criticism and aggression.

source: སོ་སོར་རྟོག་པ་ནི་ནང་ཡོངས་སུ་གདུང་བ་མེད་པར་བྱེད་པའོ། །
en: Contemplation is eliminating inner pain.

source: སྒྲུབ་པ་ནི་བདག་དང་གཞན་མི་དམིགས་པའོ། །
en: Accomplishment is not apprehending self or other.

source: གཞན་ཡང་རྩོམ་པ་ནི་ལེ་ལོའི་དྲི་མ་སེལ་བའོ། །
en: “ ‘Also, endeavor is eliminating the stain of laziness.

source: རྟུལ་བ་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་ལས་དབེན་པའོ། །
en: Commitment is disengaging from the stain of diligence.

source: སོ་སོར་རྟོག་པ་ནི་སེམས་ཅན་ལེ་ལོ་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའོ། །
en: Contemplation is ripening lazy beings.

source: སྒྲུབ་པ་ནི་དེའི་བྱ་བ་བྱེད་པའོ། །
en: Accomplishment is engaging in these actions.

source: གཞན་ཡང་རྩོམ་པ་ནི་བྱ་བ་ཡང་དག་པར་སྒྲུབ་པའོ། །
en: “ ‘Also, endeavor is accomplishing one’s tasks.

source: རྟུལ་བ་ནི་བྱ་བ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའོ། །
en: Commitment is mastering one’s tasks.

source: སོ་སོར་རྟོག་པ་ནི་ཐེག་པ་གཞན་ལ་མི་རེ་བའོ། །
en: Contemplation is not putting one’s hopes in other vehicles.

source: སྒྲུབ་པ་ནི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཆུད་མི་གཟོན་པའོ། །
en: Accomplishment is not losing faith in karmic ripening.

source: གཞན་ཡང་རྩོམ་པ་ནི་དྲན་པའོ། །
en: “ ‘Also, endeavor is mindfulness.

source: རྟུལ་བ་ནི་རྟོགས་པའོ། །
en: Commitment is understanding.

source: སོ་སོར་རྟོག་པ་ནི་བློ་གྲོས་སོ། །
en: Contemplation is intelligence.

source: སྒྲུབ་པ་ནི་མོས་པའོ། །
en: Accomplishment is aspiration.

source: གཞན་ཡང་རྩོམ་པ་ནི་རིག་པའོ། །
en: “ ‘Also, endeavor is knowledge.

source: རྟུལ་བ་ནི་ཚུལ་ལོ། །
en: Commitment is a way.

source: སོ་སོར་རྟོག་པ་ནི་སྒོའོ། །
en: Contemplation is a gateway.

source: སྒྲུབ་པ་ནི་འབྱུང་བའོ། །
en: Accomplishment is the occurrence of those.

source: གཞན་ཡང་རྩོམ་པ་ནི་ཚིག་འབྲུ་ཀུན་ཆུབ་པར་བྱེད་པའོ། །
en: “ ‘Also, endeavor is mastering language.

source: རྟུལ་བ་ནི་ཚིག་འབྲུ་འཛིན་པའོ། །
en: Commitment is using language.

source: སོ་སོར་རྟོག་པ་ནི་ཚིག་འབྲུ་སེལ་བའོ། །
en: Contemplation is eliminating language.

source: སྒྲུབ་པ་ནི་ཆོས་བརྗོད་དུ་མེད་པར་རྟོགས་པའོ། །
en: Accomplishment is realizing the Dharma to be indescribable.

source: གཞན་ཡང་རྩོམ་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རྟེན་པའོ། །
en: “ ‘Also, endeavor is relying on a spiritual friend.

source: རྟུལ་བ་ནི་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤོང་བའོ། །
en: Commitment is abandoning evil companions.

source: སོ་སོར་རྟོག་པ་ནི་མཛའ་བ་དང་མི་མཛའ་བ་རྣམས་ལ་སེམས་སྙོམས་པའོ། །
en: Contemplation is equanimity toward friends and enemies.

source: སྒྲུབ་པ་ནི་ཇི་སྐད་སྨྲས་པའི་ཚིག་དང་མི་འགལ་བར་བྱེད་པའོ། །
en: Accomplishment is not acting contrary to what one espouses.

source: གཞན་ཡང་རྩོམ་པ་ནི་རབ་ཏུ་བྱུང་བའི་སེམས་སོ། །
en: “ ‘Also, endeavor is the mind that goes forth.

source: རྟུལ་བ་ནི་དགའ་བ་དང་མི་དགའ་བ་ལ་མི་ལྟ་བའོ། །
en: Commitment is to disregard joy and displeasure.

source: སོ་སོར་རྟོག་པ་ནི་དགེ་བ་ཅི་ཞེས་ཚོལ་བའོ། །
en: Contemplation is investigating what virtue is.

source: སྒྲུབ་པ་ནི་གཞན་ལ་རག་མ་ལུས་པར་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པའོ། །
en: Accomplishment is attaining wisdom without relying on anything else.

source: གཞན་ཡང་རྩོམ་པ་ནི་དགོན་པ་ལ་གནས་པའོ། །
en: “ ‘Also, endeavor is staying in seclusion.

source: རྟུལ་བ་ནི་འདུ་འཛི་ལ་མི་དགའ་བའོ། །
en: Commitment is disliking distractions.

source: སོ་སོར་རྟོག་པ་ནི་དབེན་པར་གནས་པ་ལ་དགའ་བའོ། །
en: Contemplation is delighting in solitude.

source: སྒྲུབ་པ་ནི་ཉོན་མོངས་པ་མེད་པར་གནས་པའོ། །
en: Accomplishment is living without afflictions.

source: གཞན་ཡང་རྩོམ་པ་ནི་འདོད་པ་ཆུང་བའོ། །
en: “ ‘Also, endeavor is having few desires.

source: རྟུལ་བ་ནི་ཆོག་ཤེས་པའོ། །
en: Commitment is being content.

source: སོ་སོར་རྟོག་པ་ནི་དགང་སླ་བའོ། །
en: Contemplation is being easily sated.

source: སྒྲུབ་པ་ནི་རུང་བ་ལ་ཚོད་ཤེས་པའོ། །
en: Accomplishment is knowing the right measures.

source: གཞན་ཡང་རྩོམ་པ་ནི་ལྷག་པའི་ཚུལ་ཁྲིམས་ལ་སློབ་པའོ། །
en: “ ‘Also, endeavor is training in higher discipline.

source: རྟུལ་བ་ནི་ཚུལ་ཁྲིམས་མི་ལྷོད་པའོ། །
en: Commitment is not relaxing one’s discipline.

source: སོ་སོར་རྟོག་པ་ནི་ལྷག་པའི་སེམས་ལ་སློབ་པའོ། །
en: Contemplation is training in higher motivation.

source: སྒྲུབ་པ་ནི་ལྷག་པའི་ཤེས་རབ་ལ་སློབ་པའོ། །
en: Accomplishment is training in higher insight.

source: གཞན་ཡང་རྩོམ་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “ ‘Also, endeavor denotes the perfections of generosity and discipline.

source: རྟུལ་བ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Commitment denotes the perfections of patience and diligence.

source: སོ་སོར་རྟོག་པ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Contemplation denotes the perfections of concentration and insight.

source: སྒྲུབ་པ་ནི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Accomplishment denotes the perfections of wisdom and skill in means.

source: གཞན་ཡང་རྩོམ་པ་ནི་སྦྱིན་པའོ། །
en: “ ‘Also, endeavor is giving.

source: རྟུལ་བ་ནི་སྙན་པར་སྨྲ་བའོ། །
en: Commitment is speaking pleasantly.

source: སོ་སོར་རྟོག་པ་ནི་དོན་བྱེད་པའོ། །
en: Contemplation is acting meaningfully.

source: སྒྲུབ་པ་ནི་དོན་འཐུན་པའོ། །
en: Accomplishment is being in tune with the truth.

source: གཞན་ཡང་རྩོམ་པ་ནི་བྱམས་པ་ཆེན་པོའོ། །
en: “ ‘Also, endeavor is great love.

source: རྟུལ་བ་ནི་སྙིང་རྗེ་ཆེན་པོའོ། །
en: Commitment is great compassion.

source: སོ་སོར་རྟོག་པ་ནི་དགའ་བ་ཆེན་པོའོ། །
en: Contemplation is great joy.

source: སྒྲུབ་པ་ནི་བཏང་སྙོམས་ཆེན་པོའོ། །
en: Accomplishment is great equanimity.

source: གཞན་ཡང་རྩོམ་པ་ནི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པའོ། །
en: “ ‘Also, endeavor is purifying realms.

source: རྟུལ་བ་ནི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: Commitment is perfecting the major and minor marks of perfection.

source: སོ་སོར་རྟོག་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Contemplation is upholding the sublime Dharma.

source: སྒྲུབ་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའོ། །
en: Accomplishment is ripening beings.

source: གཞན་ཡང་རྩོམ་པ་ནི་ཕུང་པོའི་བདུད་ཡོངས་སུ་ཤེས་པའོ། །
en: “ ‘Also, endeavor is understanding the māra of the aggregates.

source: རྟུལ་བ་ནི་ཉོན་མོངས་པའི་བདུད་ལས་ཤིན་ཏུ་འདའ་བའོ། །
en: Commitment is transcending the māra of the afflictions.

source: སོ་སོར་རྟོག་པ་ནི་འཆི་བདག་གི་བདུད་རྣམ་པར་སྤོང་བའོ། །
en: Contemplation is abandoning the māra of the Lord of Death.

source: སྒྲུབ་པ་ནི་ལྷའི་བུའི་བདུད་ཕམ་པར་བྱེད་པའོ། །
en: Accomplishment is defeating the māra of the gods.

source: གཞན་ཡང་རྩོམ་པ་ནི་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པའོ། །
en: “ ‘Also, endeavor is understanding suffering.

source: རྟུལ་བ་ནི་ཀུན་འབྱུང་བ་སྤོང་བའོ། །
en: Commitment is abandoning its origin.

source: སོ་སོར་རྟོག་པ་ནི་ལམ་སྒོམ་པའོ། །
en: Contemplation is cultivating the path.

source: སྒྲུབ་པ་ནི་འགོག་པ་མངོན་སུམ་དུ་བྱེད་པའོ། །
en: Accomplishment is actualizing cessation.

source: གཞན་ཡང་རྩོམ་པ་ནི་ལུས་ལ་ཞུགས་པའི་དྲན་པའོ། །
en: “ ‘Also, endeavor is the application of mindfulness to the body.

source: རྟུལ་བ་ནི་ཚོར་བ་ལ་ཞུགས་པའི་དྲན་པའོ། །
en: Commitment is the application of mindfulness to sensations.

source: སོ་སོར་རྟོག་པ་ནི་སེམས་ལ་ཞུགས་པའི་དྲན་པའོ། །
en: Contemplation is the application of mindfulness to mind.

source: སྒྲུབ་པ་ནི་ཆོས་ལ་ཞུགས་པའི་དྲན་པའོ། །
en: Accomplishment is the application of mindfulness to phenomena.

source: གཞན་ཡང་རྩོམ་པ་ནི་དད་པའོ། །
en: “ ‘Also, endeavor is faith.

source: རྟུལ་བ་ནི་བརྩོན་འགྲུས་སོ། །
en: Commitment is diligence.

source: སོ་སོར་རྟོག་པ་ནི་དྲན་པ་དང་ཏིང་ངེ་འཛིན་ཏོ། །
en: Contemplation is mindfulness and concentration.

source: སྒྲུབ་པ་ནི་ཤེས་རབ་བོ། །
en: Accomplishment is insight.

source: གཞན་ཡང་རྩོམ་པ་ནི་མི་དགེ་བའི་ཆོས་སྤོང་བའོ། །
en: “ ‘Also, endeavor is abandoning nonvirtuous phenomena.

source: རྟུལ་བ་ནི་དགེ་བའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: Commitment is perfecting virtuous phenomena.

source: སོ་སོར་རྟོག་པ་ནི་ལུས་དང་སེམས་ལས་སུ་རུང་བར་བྱེད་པའོ། །
en: Contemplation is making the body and mind pliant.

source: སྒྲུབ་པ་ནི་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་རབ་ཏུ་ཐོབ་པར་བྱེད་པའོ། །
en: Accomplishment is attaining unconditioned miracles.

source: གཞན་ཡང་རྩོམ་པ་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ལའོ། །
en: “ ‘Also, endeavor is the branches of awakening.

source: རྟུལ་བ་ནི་ལམ་ལའོ། །
en: Commitment is the path.

source: སོ་སོར་རྟོག་པ་ནི་ཞི་གནས་དང་ལྷག་མཐོང་ལའོ། །
en: Contemplation is tranquility and special insight.

source: སྒྲུབ་པ་ནི་རིག་པ་དང་རྣམ་པར་གྲོལ་བ་ལའོ། །
en: Accomplishment is knowledge and liberation.

source: གཞན་ཡང་རྩོམ་པ་ནི་འཇུག་པའི་སྤྱོད་པའོ། །
en: “ ‘Also, endeavor is engaged conduct.

source: རྟུལ་བ་ནི་དཀར་པོ་རྣམ་པར་མཐོང་བའི་སྤྱོད་པའོ། །
en: Commitment is the conduct aimed at the good.

source: སོ་སོར་རྟོག་པ་ནི་སེམས་ཤིན་ཏུ་སྦྱངས་པའོ། །
en: Contemplation is a refined mind.

source: སྒྲུབ་པ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཡེ་ཤེས་སོ། །
en: Accomplishment is irreversible wisdom.’

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་འབར་བ་དེས། བྱང་ཆུབ་སེམས་དཔའ་གོ་ཆ་སྲ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Moreover, Sāgaramati, the blessed thus-gone Dīptavīrya said to the bodhisattva Solid Armor,

source: རིགས་ཀྱི་བུ་བརྩོན་འགྲུས་དེ་ནི་གང་ལུས་དང་སེམས་ཡོངས་སུ་སྦྱངས་པའོ། །བརྩོན་འགྲུས་དེ་ནི་གང་རྒྱུ་དང་ལྟ་བ་དང་བྲལ་བའོ། །
en: ‘Noble son, diligence purifies body and mind.

source: བརྩོན་འགྲུས་དེ་ནི་གང་མིང་དང་གཟུགས་ཡོངས་སུ་ཤེས་པའོ། །
en: Diligence understands name and form.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་འགོག་པའོ། །
en: Diligence ends self-grasping and grasping to what is “mine.”

source: བརྩོན་འགྲུས་དེ་ནི་གང་འཛིན་པ་དང་། འཆིང་བ་འདོར་བའོ། །
en: Diligence casts aside grasping and bondage.

source: བརྩོན་འགྲུས་དེ་ནི་གང་སྒྲིབ་པ་རྣམས་དང་ཀུན་ནས་ལྡང་བ་རྣམས་རྣམ་པར་སེལ་བའོ། །
en: Diligence eliminates obscurations and upheavals.

source: བརྩོན་འགྲུས་དེ་ནི་གང་འགྱོད་པ་དང་ཐེ་ཙོམ་སྤོང་བའོ། །
en: Diligence abandons regret and doubt.

source: བརྩོན་འགྲུས་དེ་ནི་གང་མདུད་པ་རྣམས་དང་ཟུག་རྔུ་རྣམས་ཡང་དག་པར་སེལ་བའོ། །
en: Diligence eliminates knots and pain.

source: བརྩོན་འགྲུས་དེ་ནི་གང་དམིགས་པ་དང་། རྒྱུན་ཆད་པ་ལས་ཤིན་ཏུ་འདའ་བའོ། །
en: Diligence transcends reference points and discontinuity.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ང་རྒྱལ་དང་མངོན་པའི་ང་རྒྱལ་རྣམ་པར་སྤོང་བའོ། །
en: Diligence discards both ordinary pride and excessive pride.

source: བརྩོན་འགྲུས་དེ་ནི་གང་གཞི་དང་གནས་ལས་ཤིན་ཏུ་འདའ་བའོ། །
en: Diligence transcends ground and location.

source: བརྩོན་འགྲུས་དེ་ནི་གང་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་སྤོང་བའོ། །
en: Diligence discards attachment and aggression.

source: བརྩོན་འགྲུས་དེ་ནི་གང་མ་རིག་པ་དང་། སྲིད་པའི་སྲེད་པ་རབ་ཏུ་སྦྱངས་པའོ། །
en: Diligence purifies ignorance and the craving for existence.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ཆགས་པ་དང་ཞེ་སྡང་ཀུན་ཏུ་མི་རྒྱུ་བའོ། །
en: Diligence is not motivated by attachment and aggression.

source: བརྩོན་འགྲུས་དེ་ནི་གང་གཏི་མུག་དང་སོ་སོར་མི་རྟོག་པ་དང་བྲལ་བའོ། །
en: Diligence is free of stupidity and lack of discrimination.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ནང་དང་ཕྱིའི་སྐྱེ་མཆེད་རྣམས་ཡོངས་སུ་ཤེས་པའོ། །
en: Diligence understands inner and outer sense sources.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ཕུང་པོ་དང་ཁམས་རྣམས་གདོད་མ་ནས་སྐྱེ་བ་མེད་པའོ། །
en: Diligence sees that the aggregates and elements are primordially unborn.

source: བརྩོན་འགྲུས་དེ་ནི་གང་སེམས་ཞི་བ་དང་རབ་ཏུ་ཞི་བ་དང་ཉེ་བར་ཞི་བའོ། །
en: Diligence pacifies, quells, and calms the mind.

source: བརྩོན་འགྲུས་དེ་ནི་གང་རྣམ་པར་བསམས་ན་ཆོས་ཐམས་ཅད་མི་དམིགས་པའོ། །
en: Diligence does not observe any phenomena when it contemplates them.

source: བརྩོན་འགྲུས་དེ་ནི་གང་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་དབྱེར་མེད་པའོ། །
en: Diligence is nondual and inseparable.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ཆོས་ཉིད་གནས་པར་ཤེས་པའོ། །
en: Diligence fully understands reality.

source: བརྩོན་འགྲུས་དེ་ནི་གང་འཕྲོ་བ་མེད་ཅིང་མི་འཕྲོ་བ་མེད་པའོ། །
en: Diligence is without proliferation or inactivity.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ལེན་པ་མེད་ཅིང་འདོར་བ་མེད་པའོ། །
en: Diligence is without acquisition or abandonment.

source: བརྩོན་འགྲུས་དེ་ནི་གང་བྱེད་པ་མེད་ཅིང་བྱེད་པ་དང་བྲལ་བ་མ་ཡིན་པའོ། །
en: Diligence does nothing, yet neither is it without action.

source: བརྩོན་འགྲུས་དེ་ནི་གང་འདེག་པ་མེད་ཅིང་གཞག་པ་མེད་པའོ། །
en: Diligence is without raising up or setting down.

source: བརྩོན་འགྲུས་དེ་ནི་གང་བླང་བ་མེད་ཅིང་དོར་བ་མེད་པའོ། །
en: Diligence is without taking up or discarding.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ལ་བཅིང་བ་མེད་ཅིང་གྲོལ་བ་མེད་པའོ། །
en: Diligence is without bondage or liberation.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ལ་གནོན་པ་མེད་པ་དང་། ཕ་རོལ་གནོན་པ་མེད་པའོ། །
en: Diligence is untrammeled and does not trammel upon others.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ལ་རྒྱགས་པ་མེད་པ་དང་བག་མེད་པ་མ་ཡིན་པའོ། །
en: Diligence is neither arrogant nor careless.
